environment/bbs_app/app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "name", "created_at", "updated_at", "topic_id") VALUES (?, ?, ?, ?, ?)  [["content", "test"], ["name", "test"], ["created_at", "2019-11-24 17:33:22.884352"], ["updated_at", "2019-11-24 17:33:22.884352"], ["topic_id", 6]]
---
  def create
    @post = Post.new(post_params)
    if @post.name == ""
      @post.name = "ネットエリートさん"
    end
    respond_to do |format|
      if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY "posts"."created_at" DESC LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def set_post
      @post = Post.find(params[:id])