app/controllers/topics_controller.rb

SELECT  `topics`.* FROM `topics` WHERE (title LIKE '%%' OR content LIKE '%%') ORDER BY `topics`.`created_at` DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM `topics`
---
  def index
     @topics = Topic.paginate(page: params[:page])

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? ORDER BY "topics"."created_at" DESC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."topic_id" = ? ORDER BY "posts"."created_at" DESC  [["topic_id", 2]]
---
  def show
    @topic = Topic.find(params[:id])
    @posts = Post.all  ##直すところ

INSERT INTO "topics" ("title", "name", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "test"], ["name", "test"], ["content", "test"], ["created_at", "2019-11-23 21:58:17.914205"], ["updated_at", "2019-11-23 21:58:17.914205"]]
---
  def create
    @topic = Topic.new(topic_params)
    respond_to do |format|
      if @topic.save

UPDATE "topics" SET "content" = ?, "updated_at" = ? WHERE "topics"."id" = ?  [["content", "testtest"], ["updated_at", "2019-11-24 17:52:10.355920"], ["id", 13]]
---
  def update
    respond_to do |format|
      if @topic.update(topic_params)

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? ORDER BY "topics"."created_at" DESC LIMIT ?  [["id", 13], ["LIMIT", 1]]
---
    def set_topic
      @topic = Topic.find(params[:id])