bbs_app/app/controllers/delrequests_controller.rb

SELECT  `delrequests`.* FROM `delrequests` LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM `delrequests`
---
  def index
    @delrequests = Delrequest.paginate(page: params[:page])

INSERT INTO "delrequests" ("address", "del_id", "reason", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["address", "test"], ["del_id", "test"], ["reason", "test"], ["created_at", "2019-11-27 20:02:39.793983"], ["updated_at", "2019-11-27 20:02:39.793983"]]
---
  def create
    @delrequest = Delrequest.new(delrequest_params)

    respond_to do |format|
      if @delrequest.save

DELETE FROM `delrequests` WHERE `delrequests`.`id` = 3
---
  def destroy
    @delrequest.destroy

SELECT  "delrequests".* FROM "delrequests" WHERE "delrequests"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_delrequest
      @delrequest = Delrequest.find(params[:id])