bbs_app/app/controllers/posts_controller.rb

  def show
    @post = Post.new(:topic_id => params[:id])
    @topic = Topic.find(params[:id])
---
SELECT  `topics`.* FROM `topics` WHERE `topics`.`id` = 4 ORDER BY `topics`.`created_at` DESC LIMIT 1

  def create
    @post = Post.new(post_params)
    if @post.name == ""
      @post.name = "名無しさん"
    end
    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("content", "name", "created_at", "updated_at", "image", "topic_id") VALUES (?, ?, ?, ?, ?, ?)  [["content", "test"], ["name", "ネットエリートさん"], ["created_at", "2019-11-27 05:17:06.890450"], ["updated_at", "2019-11-27 05:17:06.890450"], ["image", "20191127141706.jpg"], ["topic_id", 4]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE `posts` SET `content` = 'test\r\ne\r\ns\r\nt', `updated_at` = '2019-12-08 16:29:39' WHERE `posts`.`id` = 4

    def set_post
      @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY "posts"."created_at" DESC LIMIT ?  [["id", nil], ["LIMIT", 1]]