bbs_app/app/controllers/topics_controller.rb

  def index
     @topics = Topic.paginate(page: params[:page])
---
SELECT  `topics`.* FROM `topics` WHERE (title LIKE '%%' OR content LIKE '%%') ORDER BY `topics`.`created_at` DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM `topics` WHERE (title LIKE '%%' OR content LIKE '%%')

  def show
    @post = Post.new(:topic_id => params[:id])
    @posts = Post.where(topic_id: params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."topic_id" = ? ORDER BY "posts"."created_at" DESC  [["topic_id", 2]]

  def create
    @topic = Topic.new(topic_params)
    #debugger
    if @topic.name == ""
      @topic.name = "名無しさん"
    end
    respond_to do |format|
      if @topic.save
---
INSERT INTO "topics" ("title", "name", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "test"], ["name", "test"], ["content", "test"], ["created_at", "2019-11-23 21:58:17.914205"], ["updated_at", "2019-11-23 21:58:17.914205"]]

  def update
    respond_to do |format|
      if @topic.update(topic_params)
---
UPDATE "topics" SET "content" = ?, "updated_at" = ? WHERE "topics"."id" = ?  [["content", "testtest"], ["updated_at", "2019-11-24 17:52:10.355920"], ["id", 13]]

    def set_topic
      @topic = Topic.find(params[:id])
---
SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? ORDER BY "topics"."created_at" DESC LIMIT ?  [["id", 13], ["LIMIT", 1]]